{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "batch_input_shape": [null, 3, 28, 28], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "linear", "name": "conv2d_1", "kernel_size": [3, 3], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_first", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "activation": "linear", "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "activation": "linear", "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.6", "class_name": "Sequential"}